var es = require('./test_stock')

var stock_list = [
    {"code":"600252","time":"2015-5-14","title":"第1条"},
    {"code":"600252","time":"2015-4-14","title":"第2条"},
    {"code":"600252","time":"2015-2-14","title":"第3条"},
    {"code":"600252","time":"2014-12-14","title":"第4条"},
    {"code":"600252","time":"2014-10-14","title":"第5条"},
    {"code":"600252","time":"2014-8-14","title":"第6条"},
    {"code":"600252","time":"2014-6-14","title":"第7条"},
    {"code":"600252","time":"2014-4-14","title":"第8条"},
    {"code":"600252","time":"2014-2-14","title":"第9条"},
    {"code":"600252","time":"2013-12-14","title":"第10条"},
    {"code":"600252","time":"2013-10-14","title":"第11条"},
    {"code":"600252","time":"2013-8-14","title":"第12条"},
    {"code":"600252","time":"2013-6-14","title":"第13条"},
    {"code":"600252","time":"2013-4-14","title":"第14条"},
    {"code":"600252","time":"2013-2-14","title":"第15条"},
    {"code":"600252","time":"2012-12-14","title":"第16条"},
    {"code":"600252","time":"2012-10-14","title":"第17条"},
    {"code":"600252","time":"2012-8-14","title":"第18条"},
    {"code":"600252","time":"2012-6-14","title":"第19条"},
    {"code":"600252","time":"2012-4-14","title":"第20条"},
    {"code":"600252","time":"2012-2-14","title":"第21条"},
    {"code":"600252","time":"2011-12-14","title":"第22条"},
    {"code":"600252","time":"2011-10-14","title":"第23条"},
    {"code":"600252","time":"2011-8-14","title":"第24条"},
    {"code":"600252","time":"2011-6-14","title":"第25条"},
    {"code":"600252","time":"2011-4-14","title":"第26条"},
    {"code":"600252","time":"2011-2-14","title":"第27条"},
    {"code":"600252","time":"2010-12-14","title":"第28条"},
    {"code":"600252","time":"2010-10-14","title":"第29条"},
    {"code":"600252","time":"2010-8-14","title":"第30条"},
    {"code":"600252","time":"2010-6-14","title":"第31条"},
    {"code":"600252","time":"2010-4-14","title":"第32条"},
    {"code":"600252","time":"2010-2-14","title":"第33条"},
    {"code":"600252","time":"2009-12-14","title":"第34条"},
    {"code":"600252","time":"2009-10-14","title":"第35条"},
    {"code":"600252","time":"2009-8-14","title":"第36条"},
    {"code":"600252","time":"2009-6-14","title":"第37条"},
    {"code":"600252","time":"2009-4-14","title":"第38条"},
    {"code":"600252","time":"2009-2-14","title":"第39条"},
    {"code":"600252","time":"2008-12-14","title":"第40条"},
    {"code":"600252","time":"2008-10-14","title":"第41条"},
    {"code":"600252","time":"2008-8-14","title":"第42条"},
    {"code":"600252","time":"2008-6-14","title":"第43条"},
    {"code":"600252","time":"2008-4-14","title":"第44条"},
    {"code":"600252","time":"2008-2-14","title":"第45条"}
];

var count = 0;
setInterval(function(){
    es.indexStock(stock_list[count]);
    count=count+1
    console.log("add index success");
},2000)